Hakuuyosei/QQHistoryExport/CMSIS/Device/PY32F0xx/Include/py32f030x8.h
/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_Pos       (0U)
#define IWDG_PR_PR_Msk       (0x7UL << IWDG_PR_PR_Pos)                         /*!< 0x00000007 */
#define IWDG_PR_PR           IWDG_PR_PR_Msk                                    /*!<PR[2:0] (Prescaler divider)         */
#define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_Pos)                         /*!< 0x00000001 */
#define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_Pos)                         /*!< 0x00000002 */
#define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_Pos)                         /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_Pos      (0U)
#define IWDG_RLR_RL_Msk      (0xFFFUL << IWDG_RLR_RL_Pos)                      /*!< 0x00000FFF */
#define IWDG_RLR_RL          IWDG_RLR_RL_Msk                                   /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_Pos      (0U)
#define IWDG_SR_PVU_Msk      (0x1UL << IWDG_SR_PVU_Pos)                        /*!< 0x00000001 */
#define IWDG_SR_PVU          IWDG_SR_PVU_Msk                                   /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos      (1U)
#define IWDG_SR_RVU_Msk      (0x1UL << IWDG_SR_RVU_Pos)                        /*!< 0x00000002 */
#define IWDG_SR_RVU          IWDG_SR_RVU_Msk                                   /*!< Watchdog counter reload value update */
//#define IWDG_SR_WVU_Pos      (2U)
//#define IWDG_SR_WVU_Msk      (0x1UL << IWDG_SR_WVU_Pos)                        /*!< 0x00000004 */
//#define IWDG_SR_WVU          IWDG_SR_WVU_Msk                                   /*!< Watchdog counter window value update */

/*******************  Bit definition for IWDG_WINR register  ********************/
//#define IWDG_WINR_WIN_Pos    (0U)
//#define IWDG_WINR_WIN_Msk    (0xFFFUL << IWDG_WINR_WIN_Pos)                    /*!< 0x00000FFF */
//#define IWDG_WINR_WIN        IWDG_WINR_WIN_Msk                                 /*!< Watchdog counter window value */

/******************************************************************************/
/*                                                                            */
/*                                 LED Controller (LED)                       */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for LED_CR register  *********************/
#define LED_CR_LEDON_Pos          (0U)
#define LED_CR_LEDON_Msk          (0x1UL << LED_CR_LEDON_Pos)
#define LED_CR_LEDON              LED_CR_LEDON_Msk
#define LED_CR_LED_COM_SEL_Pos    (1U)
#define LED_CR_LED_COM_SEL_Msk    (0x3UL << LED_CR_LED_COM_SEL_Pos)
#define LED_CR_LED_COM_SEL        LED_CR_LED_COM_SEL_Msk
#define LED_CR_LED_COM_SEL_0      (0x1UL << LED_CR_LED_COM_SEL_Pos)
#define LED_CR_LED_COM_SEL_1      (0x2UL << LED_CR_LED_COM_SEL_Pos)
#define LED_CR_IE_Pos             (3U)
#define LED_CR_IE_Msk             (0x1UL << LED_CR_IE_Pos)
#define LED_CR_IE                 LED_CR_IE_Msk
#define LED_CR_EHS_Pos            (12U)
#define LED_CR_EHS_Msk            (0x1UL << LED_CR_EHS_Pos)
#define LED_CR_EHS                LED_CR_EHS_Msk

/*******************  Bit definition for LED_PR register  *********************/
#define LED_PR_PR_Pos       (0U)
#define LED_PR_PR_Msk       (0xFFUL << LED_PR_PR_Pos)
#define LED_PR_PR           LED_PR_PR_Msk
#define LED_PR_PR_0         (0x01UL << LED_PR_PR_Pos)
#define LED_PR_PR_1         (0x02UL << LED_PR_PR_Pos)
#define LED_PR_PR_2         (0x04UL << LED_PR_PR_Pos)
#define LED_PR_PR_3         (0x08UL << LED_PR_PR_Pos)
#define LED_PR_PR_4         (0x10UL << LED_PR_PR_Pos)
#define LED_PR_PR_5         (0x20UL << LED_PR_PR_Pos)
#define LED_PR_PR_6         (0x40UL << LED_PR_PR_Pos)
#define LED_PR_PR_7         (0x80UL << LED_PR_PR_Pos)

/*******************  Bit definition for LED_TR register  *********************/
#define LED_TR_T1_Pos       (0U)
#define LED_TR_T1_Msk       (0xFFUL << LED_TR_T1_Pos)
#define LED_TR_T1           LED_TR_T1_Msk
#define LED_TR_T1_0         (0x01UL << LED_TR_T1_Pos)
#define LED_TR_T1_1         (0x02UL << LED_TR_T1_Pos)
#define LED_TR_T1_2         (0x04UL << LED_TR_T1_Pos)
#define LED_TR_T1_3         (0x08UL << LED_TR_T1_Pos)
#define LED_TR_T1_4         (0x10UL << LED_TR_T1_Pos)
#define LED_TR_T1_5         (0x20UL << LED_TR_T1_Pos)
#define LED_TR_T1_6         (0x40UL << LED_TR_T1_Pos)
#define LED_TR_T1_7         (0x80UL << LED_TR_T1_Pos)
#define LED_TR_T2_Pos       (8U)
#define LED_TR_T2_Msk       (0xFFUL << LED_TR_T2_Pos)
#define LED_TR_T2           LED_TR_T2_Msk
#define LED_TR_T2_0         (0x01UL << LED_TR_T2_Pos)
#define LED_TR_T2_1         (0x02UL << LED_TR_T2_Pos)
#define LED_TR_T2_2         (0x04UL << LED_TR_T2_Pos)
#define LED_TR_T2_3         (0x08UL << LED_TR_T2_Pos)
#define LED_TR_T2_4         (0x10UL << LED_TR_T2_Pos)
#define LED_TR_T2_5         (0x20UL << LED_TR_T2_Pos)
#define LED_TR_T2_6         (0x40UL << LED_TR_T2_Pos)
#define LED_TR_T2_7         (0x80UL << LED_TR_T2_Pos)

/*******************  Bit definition for LED_DR0 register  *********************/
#define LED_DR0_DATA0_Pos       (0U)
#define LED_DR0_DATA0_Msk       (0xFFUL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0           LED_DR0_DATA0_Msk
#define LED_DR0_DATA0_A         (0x01UL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0_B         (0x02UL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0_C         (0x04UL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0_D         (0x08UL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0_E         (0x10UL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0_F         (0x20UL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0_G         (0x40UL << LED_DR0_DATA0_Pos)
#define LED_DR0_DATA0_DP        (0x80UL << LED_DR0_DATA0_Pos)

#define LED_DR1_DATA1_Pos       (0U)
#define LED_DR1_DATA1_Msk       (0xFFUL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1           LED_DR1_DATA1_Msk
#define LED_DR1_DATA1_A         (0x01UL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1_B         (0x02UL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1_C         (0x04UL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1_D         (0x08UL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1_E         (0x10UL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1_F         (0x20UL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1_G         (0x40UL << LED_DR1_DATA1_Pos)
#define LED_DR1_DATA1_DP        (0x80UL << LED_DR1_DATA1_Pos)

